Project2/pksoapwsclient/result.xml


Payload:
<soap:Envelope
	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			soap:mustUnderstand="1">
			<wsse:UsernameToken
				wsu:Id="UsernameToken-8522340e-53b9-4102-a259-02b313c1af74">
				<wsse:Username>myuser</wsse:Username>
				<wsse:Password
					Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">mypassword</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</soap:Header>
	<soap:Body>
		<ns2:calculateSum
			xmlns:ns2="http://learn.pankaj.com/">
			<arg0>
				<num1>2</num1>
				<num2>5</num2>
			</arg0>
		</ns2:calculateSum>
	</soap:Body>
</soap:Envelope>


Payload:
<soap:Envelope
	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<ns2:calculateSumResponse
			xmlns:ns2="http://learn.pankaj.com/">
			<response>
				<result>7</result>
			</response>
		</ns2:calculateSumResponse>
	</soap:Body>
</soap:Envelope>
